04-02-tipos-de-dados-fundamentais.org
#+setupfile: static/setupfile.org
#+html_link_up: 04-nucleo.html
#+title: Tipos de dados fundamentais
#+options: toc:t

#+property: header-args:rust :tangle src/core/types.rs

O próximo submódulo trata dos  tipos de dados fundamentais de Majestic
Lisp. Em suma, estamos tratando  dos cinco tipos fundamentais tratados
na especificação da linguagem.

A maior  parte do código  do arquivo ~src/core/types.rs~  corresponde ao
código nesta seção.

* Importações

Nosso  primeiro  passo  é  importar  algumas  dependências  de  outros
lugares. Importamos, inicialmente, o genérico  ~Gc~ e os /traits/ ~Finalize~
e ~Trace~  da nossa biblioteca  de coletor de  lixo. Isso nos  ajudará a
garantir  que não  teremos  problemas  de coleta  de  lixo na  memória
automaticamente gerenciada para alocar nossos objetos. da linguagem.

Também utilizaremos o objeto  ~MajState~ para criarmos alguns ajudantes,
que nos levarão a algumas  facilidades ao instanciarmos nossos objetos
da linguagem.

#+begin_src rust
use gc::{Finalize, Gc, GcCell, Trace};
use super::MajState;
#+end_src

* A estrutura ~Maj~: Objetos fundamentais

O  objeto principal  (do  ponto de  vista da  linguagem  Rust) para  o
interpretador  é a  enumeração chamada  ~Maj~, utilizada  extensivamente
durante a implementação.

Em Rust,  enumerações possuem  a propriedade  especial de  agirem como
/estruturas  de  dados  polimórficas/:  para cada  caso  da  enumeração,
podemos ter um tipo de dados associado.

Os tipos de dados com enumeração associados são:

- /Symbol/  (~Maj::Sym~): Possui  um número  de tipo  ~u64~ associado,  para
  armazenar um símbolo;
- /Cons/  (~Maj::Cons~):  Possui uma  estrutura  de  dados associada  para
  armazenar uma  célula /cons/.  O /cons/  possui dois  componentes, sendo
  estes  objetos  ~Maj~,  que  sejam  necessariamente  gerenciados  pelo
  coletor de lixo.  Isto torna o /cons/ um objeto  recursivo. Por razões
  históricas, chamamos esses componentes de ~car~ e ~cdr~;
- /Char/ (~Maj::Char~): Possui um caractere de tipo ~char~ associado;
- /Stream/  (~Maj::Stream~):  Possui  uma   estrutura  de  tipo  ~MajStream~
  associada, correspondendo  a um /stream/. Essa  estrutura será tratada
  posteriormente;
- /Number/  (~Maj::Number~):  Possui  uma   estrutura  de  tipo  ~MajNumber~
  associada, correspondendo  a um /número/. Essa  estrutura será tratada
  posteriormente.

#+begin_src rust
#[derive(Debug, Trace, Finalize, Clone)]
pub enum Maj {
    Sym(u64),
    Cons {
        car: Gc<Maj>,
        cdr: Gc<Maj>
    },
    Char(char),
    Stream(MajStream),
    Number(MajNumber),
    Vector(MajVector)
}
#+end_src

* TODO Construtores de alguns tipos fundamentais

Podemos  criar alguns  métodos estáticos  para ~Maj~,  que nos  ajudem a
gerar objetos gerenciados por coletor de lixo sem muito esforço.

Para construirmos símbolos, é  obrigatório que tenhamos uma referência
mutável  a um  ~MajState~  sendo  passada, pois  símbolos  só podem  ter
significado apropriado quando em associação à tabela de símbolos. Essa
prática também garante que não  dupliquemos um certo símbolo na tabela
de símbolos.

#+begin_src rust
impl Maj {
    pub fn symbol(state: &mut MajState, str: &str) -> Gc<Maj> {
        Gc::new(Maj::Sym(state.gen_symbol(str)))
    }
}
#+end_src

# Construção de símbolo arbitrário

#+begin_src rust
impl Maj {
    pub fn gensym(state: &mut MajState) -> Gc<Maj> {
        Gc::new(Maj::Sym(state.gen_random_symbol()))
    }
}
#+end_src

Construir um  /cons/ também é  simples, uma  vez que assumimos  que seus
componentes  ~car~ e  ~cdr~  já  sejam elementos  alocados  no coletor  de
lixo. Basta então associá-los  para que tomem a forma de  um par sob a
mesma estrutura de dados.

#+begin_src rust
impl Maj {
    pub fn cons(car: Gc<Maj>, cdr: Gc<Maj>) -> Gc<Maj> {
        Gc::new(Maj::Cons { car, cdr })
    }
}
#+end_src

Caracteres são tipos ainda mais simplificados: aqui, apenas utilizamos
o tipo ~char~  subjacente de Rust para representar  nossos caracteres na
linguagem, e isso será tudo o que é necessário.

#+begin_src rust
impl Maj {
    pub fn character(chr: char) -> Gc<Maj> {
        Gc::new(Maj::Char(chr))
    }
}
#+end_src

