doc/html/04-02-tipos-de-dados-fundamentais.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tipos de dados fundamentais</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="04-nucleo.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Tipos de dados fundamentais</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaa6a914">1. Importações</a></li>
<li><a href="#org765b57d">2. A estrutura <code>Maj</code>: Objetos fundamentais</a></li>
<li><a href="#orgd47cf98">3. <span class="todo TODO">TODO</span> Construtores de alguns tipos fundamentais</a></li>
<li><a href="#orgbcc78d3">4. Construtores de strings</a></li>
<li><a href="#org7c1f079">5. Conversão booleana</a></li>
<li><a href="#org6814d04">6. Macro Rust para listas adequadas</a></li>
<li><a href="#org2323be0">7. Macro Rust para listas pontuadas</a></li>
<li><a href="#org232d99b">8. Números</a></li>
<li><a href="#org21695d9">9. Construtores de números</a></li>
<li><a href="#org004cd7b">10. Conversões para tipos numéricos</a></li>
<li><a href="#org2a3a403">11. Conversão para string</a></li>
<li><a href="#orgf5a10c7">12. <span class="todo TODO">TODO</span> Conversão para caractere</a></li>
<li><a href="#org3f0ea66">13. Recuperação de símbolo cru</a></li>
<li><a href="#orgeae756c">14. <span class="todo TODO">TODO</span> Streams</a></li>
<li><a href="#org0f30903">15. Impressão simples</a>
<ul>
<li><a href="#org0975106">15.1. Impressão simples de objetos</a></li>
<li><a href="#orged1a990">15.2. Impressão de números</a></li>
</ul>
</li>
<li><a href="#org3b7986d">16. Construtores de símbolos constantes</a></li>
</ul>
</div>
</div>
<p>
O próximo submódulo trata dos  tipos de dados fundamentais de Majestic
Lisp. Em suma, estamos tratando  dos cinco tipos fundamentais tratados
na especificação da linguagem.
</p>

<p>
A maior  parte do código  do arquivo <code>src/core/types.rs</code>  corresponde ao
código nesta seção.
</p>

<div id="outline-container-orgaa6a914" class="outline-2">
<h2 id="orgaa6a914"><span class="section-number-2">1.</span> Importações</h2>
<div class="outline-text-2" id="text-1">
<p>
Nosso  primeiro  passo  é  importar  algumas  dependências  de  outros
lugares. Importamos, inicialmente, o genérico  <code>Gc</code> e os <i>traits</i> <code>Finalize</code>
e <code>Trace</code>  da nossa biblioteca  de coletor de  lixo. Isso nos  ajudará a
garantir  que não  teremos  problemas  de coleta  de  lixo na  memória
automaticamente gerenciada para alocar nossos objetos. da linguagem.
</p>

<p>
Também utilizaremos o objeto  <code>MajState</code> para criarmos alguns ajudantes,
que nos levarão a algumas  facilidades ao instanciarmos nossos objetos
da linguagem.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::{<span style="color: #4ec9b0;">Finalize</span>, <span style="color: #4ec9b0;">Gc</span>, <span style="color: #4ec9b0;">GcCell</span>, <span style="color: #4ec9b0;">Trace</span>};
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::<span style="color: #4ec9b0;">MajState</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org765b57d" class="outline-2">
<h2 id="org765b57d"><span class="section-number-2">2.</span> A estrutura <code>Maj</code>: Objetos fundamentais</h2>
<div class="outline-text-2" id="text-2">
<p>
O  objeto principal  (do  ponto de  vista da  linguagem  Rust) para  o
interpretador  é a  enumeração chamada  <code>Maj</code>, utilizada  extensivamente
durante a implementação.
</p>

<p>
Em Rust,  enumerações possuem  a propriedade  especial de  agirem como
<i>estruturas  de  dados  polimórficas</i>:  para cada  caso  da  enumeração,
podemos ter um tipo de dados associado.
</p>

<p>
Os tipos de dados com enumeração associados são:
</p>

<ul class="org-ul">
<li><i>Symbol</i>  (<code>Maj::Sym</code>): Possui  um número  de tipo  <code>u64</code> associado,  para
armazenar um símbolo;</li>
<li><i>Cons</i>  (<code>Maj::Cons</code>):  Possui uma  estrutura  de  dados associada  para
armazenar uma  célula <i>cons</i>.  O <i>cons</i>  possui dois  componentes, sendo
estes  objetos  <code>Maj</code>,  que  sejam  necessariamente  gerenciados  pelo
coletor de lixo.  Isto torna o <i>cons</i> um objeto  recursivo. Por razões
históricas, chamamos esses componentes de <code>car</code> e <code>cdr</code>;</li>
<li><i>Char</i> (<code>Maj::Char</code>): Possui um caractere de tipo <code>char</code> associado;</li>
<li><i>Stream</i>  (<code>Maj::Stream</code>):  Possui  uma   estrutura  de  tipo  <code>MajStream</code>
associada, correspondendo  a um <i>stream</i>. Essa  estrutura será tratada
posteriormente;</li>
<li><i>Number</i>  (<code>Maj::Number</code>):  Possui  uma   estrutura  de  tipo  <code>MajNumber</code>
associada, correspondendo  a um <i>número</i>. Essa  estrutura será tratada
posteriormente.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Debug, Trace, Finalize, Clone)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #4ec9b0;">Sym</span>(<span style="color: #4ec9b0;">u64</span>),
    <span style="color: #4ec9b0;">Cons</span> {
        <span style="color: #9cdcfe;">car</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
        <span style="color: #9cdcfe;">cdr</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
    },
    <span style="color: #4ec9b0;">Char</span>(<span style="color: #4ec9b0;">char</span>),
    <span style="color: #4ec9b0;">Stream</span>(<span style="color: #4ec9b0;">MajStream</span>),
    <span style="color: #4ec9b0;">Number</span>(<span style="color: #4ec9b0;">MajNumber</span>),
    <span style="color: #4ec9b0;">Vector</span>(<span style="color: #4ec9b0;">MajVector</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd47cf98" class="outline-2">
<h2 id="orgd47cf98"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Construtores de alguns tipos fundamentais</h2>
<div class="outline-text-2" id="text-3">
<p>
Podemos  criar alguns  métodos estáticos  para <code>Maj</code>,  que nos  ajudem a
gerar objetos gerenciados por coletor de lixo sem muito esforço.
</p>

<p>
Para construirmos símbolos, é  obrigatório que tenhamos uma referência
mutável  a um  <code>MajState</code>  sendo  passada, pois  símbolos  só podem  ter
significado apropriado quando em associação à tabela de símbolos. Essa
prática também garante que não  dupliquemos um certo símbolo na tabela
de símbolos.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">symbol</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #4ec9b0;">str</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(state.gen_symbol(<span style="color: #4ec9b0;">str</span>)))
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">gensym</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(state.gen_random_symbol()))
    }
}
</pre>
</div>

<p>
Construir um  <i>cons</i> também é  simples, uma  vez que assumimos  que seus
componentes  <code>car</code> e  <code>cdr</code>  já  sejam elementos  alocados  no coletor  de
lixo. Basta então associá-los  para que tomem a forma de  um par sob a
mesma estrutura de dados.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">cons</span>(<span style="color: #9cdcfe;">car</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">cdr</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr })
    }
}
</pre>
</div>

<p>
Caracteres são tipos ainda mais simplificados: aqui, apenas utilizamos
o tipo <code>char</code>  subjacente de Rust para representar  nossos caracteres na
linguagem, e isso será tudo o que é necessário.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">character</span>(<span style="color: #9cdcfe;">chr</span>: <span style="color: #4ec9b0;">char</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(chr))
    }
}
</pre>
</div>
</div>
</div>
