04-02-tipos-de-dados-fundamentais.org
* Construtores de strings

Poderemos converter strings de Rust  para strings de Majestic Lisp.  O
processo envolve  a criação  recursiva de um  vetor da  linguagem, que
envolve criar uma ~String~ por baixo dos panos.

#+begin_src rust
impl Maj {
    pub fn string(string: &str) -> Gc<Maj> {
        Gc::new(Maj::Vector(MajVector::Char(
            GcCell::new(String::from(string)))))
    }
}
#+end_src

* Conversão booleana

Podemos abusar  um pouco da  especificação de Majestic Lisp  e definir
alguns outros métodos  que nos auxiliem a efetuar  lógica booleana com
objetos ~Maj~,  diretamente na  linguagem Rust.  Essa ideia  permite que
criemos predicados que funcionem tanto  em Majestic Lisp quanto em seu
ambiente de programação em Rust.

Os métodos estáticos ~Maj::nil~ e ~Maj::t~ criam, respectivamente, objetos
que  representem os  símbolos  ~nil~ e  ~t~. Como  pode  ser observado,  a
criação desses símbolos *não depende de um estado do interpretador*, uma
vez  que, pela  nossa implementação,  é *garantido*  que estes  símbolos
assumam   os  índices   ~0~  e   ~1~   na  tabela   de  símbolos,   também
respectivamente.  Isso  será  melhor  visto na  seção  de  /axiomas/  da
linguagem, discutidos posteriormente.

#+begin_src rust
impl Maj {
    pub fn nil() -> Gc<Maj> {
        Gc::new(Maj::Sym(0))
    }

    pub fn t() -> Gc<Maj> {
        Gc::new(Maj::Sym(1))
    }
}
#+end_src

Podemos, agora,  criar um método  ~Maj::to_bool~, que converte  um certo
objeto para um valor booleano em Rust, correspondente a ~true~ ou ~false~.

Essa conversão  é feita  de acordo com  a especificação  da linguagem:
este  método só  retornará ~false~  quando o  objeto em  questão for  um
símbolo, e for idêntico ao  símbolo ~nil~. Para demais casos, retorna-se
sempre ~true~.

Podemos  tornar  a  implementação   desse  método  mais  eficiente  ao
valermo-nos do  mesmo princípio  dos métodos estáticos  anteriores, de
que  alguns  símbolos possuem  valores  sempre  específicos por  serem
/axiomas/  da linguagem.  Assim, uma  falsidade será  indicada quando  o
símbolo que o objeto atual representa possuir um índice igual a ~0~.

#+begin_src rust
impl Maj {
    pub fn to_bool(&self) -> bool {
        if let Maj::Sym(idx) = self {
            !(*idx == 0)
        } else {
            true
        }
    }
}
#+end_src

* Macro Rust para listas adequadas

Um  aspecto interessante  de  um  ~Maj::Cons~ é  que  o  mesmo pode  ser
utilizado para compor listas, de acordo com a especificação.

Listas /adequadas/ são, de acordo  com a especificação, aquelas formadas
por encadeamento  de células /cons/,  de forma que  o ~cdr~ de  uma célula
seja ~nil~ ou  outra célula /cons/, que recursivamente  deverá obedecer ao
mesmo princípio. Assim, a lista

#+begin_example
(a . (b . (c . nil)))
#+end_example

poderá ser  criada, em  Rust, da seguinte  forma (assumindo  um estado
global mutável ~state~):

#+begin_src rust :tangle no
// Exemplo
Maj::cons(
    Maj::symbol(&mut state, "a"),
    Maj::cons(
        Maj::symbol(&mut state, "b"),
        Maj::cons(
            Maj::symbol(&mut state, "c"),
            Maj::nil())));
#+end_src

Ainda que  essa forma de  construição já  mostre o poder  recursivo da
estrutura,  ela  é  inadequada  para   uso  imediato:  sua  escrita  é
trabalhosa e ocupa espaço desnecessário.

Assim, poderemos  criar um /macro/,  na linguagem Rust, que  *escreva por
nós* toda essa estrutura, eliminando sintaxe desnecessária.

Macros de Rust  têm uma sintaxe peculiar, portanto  vale aqui abreviar
rapidamente o que o mesmo  faz. Primeiramente, devemos identificar que
nosso  macro deverá  funcionar /recursivamente/,  e que  deverá observar
duas situações de escrita:

1. Estamos  descrevendo o  último elemento de  uma lista:  nesse caso,
   basta utilizar ~Maj::cons~  e especificar ~car~ como  sendo este último
   elemento, e ~cdr~ como sendo o símbolo ~nil~;
2. Estamos descrevendo um elemento em qualquer outra posição da lista:
   nesse caso, basta  utilizar ~Maj::cons~ e especificar  ~car~ como sendo
   este  elemento.  Os  próximos   elementos  serão  então  atribuídos
   recursivamente ao ~cdr~, através do mesmo macro.

Se nosso macro  se chama ~maj_list!~, então podemos  identificar as duas
situações dessa forma, sintaticamente:

#+begin_example
1. maj_list!(x)       => Maj::cons(x, Maj::nil())
2. maj_list!(x, r...) => Maj::cons(x, maj_list!(r...))
#+end_example

Basta  agora identificarmos  as situações  e escrevermo-nas  como duas
regras  sintáticas do  macro em  questão.  O elemento  atual é  sempre
escrito como uma  /expressão/ da linguagem Rust; se tivermos  mais de um
elemento passado a ~maj_list!~, então  isso significa que precisamos nos
adequar à  segunda regra,  que chamará o  macro recursivamente  para o
~cdr~.

#+begin_src rust
#[macro_export]
macro_rules! maj_list {
    ($x:expr) => (Maj::cons($x, Maj::nil()));

    ($x:expr, $($y:expr),+) => (
	    Maj::cons($x, maj_list!($($y),+))
    )
}
#+end_src

Munidos dessa nova  notação, podemos reescrever o  exemplo anterior de
forma simplificada e muito mais didática:

#+begin_src rust :tangle no
// Exemplo
maj_list!(Maj::symbol(&mut state, "a"),
          Maj::symbol(&mut state, "b"),
          Maj::symbol(&mut state, "c"));
#+end_src

