doc/html/04-02-tipos-de-dados-fundamentais.html

<div id="outline-container-orgbcc78d3" class="outline-2">
<h2 id="orgbcc78d3"><span class="section-number-2">4.</span> Construtores de strings</h2>
<div class="outline-text-2" id="text-4">
<p>
Poderemos converter strings de Rust  para strings de Majestic Lisp.  O
processo envolve  a criação  recursiva de um  vetor da  linguagem, que
envolve criar uma <code>String</code> por baixo dos panos.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">string</span>(<span style="color: #9cdcfe;">string</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(<span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(
            <span style="color: #4ec9b0;">GcCell</span>::new(<span style="color: #4ec9b0;">String</span>::from(string)))))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c1f079" class="outline-2">
<h2 id="org7c1f079"><span class="section-number-2">5.</span> Conversão booleana</h2>
<div class="outline-text-2" id="text-5">
<p>
Podemos abusar  um pouco da  especificação de Majestic Lisp  e definir
alguns outros métodos  que nos auxiliem a efetuar  lógica booleana com
objetos <code>Maj</code>,  diretamente na  linguagem Rust.  Essa ideia  permite que
criemos predicados que funcionem tanto  em Majestic Lisp quanto em seu
ambiente de programação em Rust.
</p>

<p>
Os métodos estáticos <code>Maj::nil</code> e <code>Maj::t</code> criam, respectivamente, objetos
que  representem os  símbolos  <code>nil</code> e  <code>t</code>. Como  pode  ser observado,  a
criação desses símbolos <b>não depende de um estado do interpretador</b>, uma
vez  que, pela  nossa implementação,  é <b>garantido</b>  que estes  símbolos
assumam   os  índices   <code>0</code>  e   <code>1</code>   na  tabela   de  símbolos,   também
respectivamente.  Isso  será  melhor  visto na  seção  de  <i>axiomas</i>  da
linguagem, discutidos posteriormente.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">nil</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(0))
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">t</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(1))
    }
}
</pre>
</div>

<p>
Podemos, agora,  criar um método  <code>Maj::to_bool</code>, que converte  um certo
objeto para um valor booleano em Rust, correspondente a <code>true</code> ou <code>false</code>.
</p>

<p>
Essa conversão  é feita  de acordo com  a especificação  da linguagem:
este  método só  retornará <code>false</code>  quando o  objeto em  questão for  um
símbolo, e for idêntico ao  símbolo <code>nil</code>. Para demais casos, retorna-se
sempre <code>true</code>.
</p>

<p>
Podemos  tornar  a  implementação   desse  método  mais  eficiente  ao
valermo-nos do  mesmo princípio  dos métodos estáticos  anteriores, de
que  alguns  símbolos possuem  valores  sempre  específicos por  serem
<i>axiomas</i>  da linguagem.  Assim, uma  falsidade será  indicada quando  o
símbolo que o objeto atual representa possuir um índice igual a <code>0</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_bool</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">bool</span> {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(idx) = <span style="color: #569cd6;">self</span> {
            !(*idx == 0)
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">true</span>
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6814d04" class="outline-2">
<h2 id="org6814d04"><span class="section-number-2">6.</span> Macro Rust para listas adequadas</h2>
<div class="outline-text-2" id="text-6">
<p>
Um  aspecto interessante  de  um  <code>Maj::Cons</code> é  que  o  mesmo pode  ser
utilizado para compor listas, de acordo com a especificação.
</p>

<p>
Listas <i>adequadas</i> são, de acordo  com a especificação, aquelas formadas
por encadeamento  de células <i>cons</i>,  de forma que  o <code>cdr</code> de  uma célula
seja <code>nil</code> ou  outra célula <i>cons</i>, que recursivamente  deverá obedecer ao
mesmo princípio. Assim, a lista
</p>

<pre class="example" id="org86e987e">
(a . (b . (c . nil)))
</pre>

<p>
poderá ser  criada, em  Rust, da seguinte  forma (assumindo  um estado
global mutável <code>state</code>):
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6a9955;">// </span><span style="color: #6a9955;">Exemplo</span>
<span style="color: #4ec9b0;">Maj</span>::cons(
    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
    <span style="color: #4ec9b0;">Maj</span>::cons(
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
        <span style="color: #4ec9b0;">Maj</span>::cons(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>),
            <span style="color: #4ec9b0;">Maj</span>::nil())));
</pre>
</div>

<p>
Ainda que  essa forma de  construição já  mostre o poder  recursivo da
estrutura,  ela  é  inadequada  para   uso  imediato:  sua  escrita  é
trabalhosa e ocupa espaço desnecessário.
</p>

<p>
Assim, poderemos  criar um <i>macro</i>,  na linguagem Rust, que  <b>escreva por
nós</b> toda essa estrutura, eliminando sintaxe desnecessária.
</p>

<p>
Macros de Rust  têm uma sintaxe peculiar, portanto  vale aqui abreviar
rapidamente o que o mesmo  faz. Primeiramente, devemos identificar que
nosso  macro deverá  funcionar <i>recursivamente</i>,  e que  deverá observar
duas situações de escrita:
</p>

<ol class="org-ol">
<li>Estamos  descrevendo o  último elemento de  uma lista:  nesse caso,
basta utilizar <code>Maj::cons</code>  e especificar <code>car</code> como  sendo este último
elemento, e <code>cdr</code> como sendo o símbolo <code>nil</code>;</li>
<li>Estamos descrevendo um elemento em qualquer outra posição da lista:
nesse caso, basta  utilizar <code>Maj::cons</code> e especificar  <code>car</code> como sendo
este  elemento.  Os  próximos   elementos  serão  então  atribuídos
recursivamente ao <code>cdr</code>, através do mesmo macro.</li>
</ol>

<p>
Se nosso macro  se chama <code>maj_list!</code>, então podemos  identificar as duas
situações dessa forma, sintaticamente:
</p>

<pre class="example" id="orgbbb2056">
1. maj_list!(x)       =&gt; Maj::cons(x, Maj::nil())
2. maj_list!(x, r...) =&gt; Maj::cons(x, maj_list!(r...))
</pre>

<p>
Basta  agora identificarmos  as situações  e escrevermo-nas  como duas
regras  sintáticas do  macro em  questão.  O elemento  atual é  sempre
escrito como uma  <i>expressão</i> da linguagem Rust; se tivermos  mais de um
elemento passado a <code>maj_list!</code>, então  isso significa que precisamos nos
adequar à  segunda regra,  que chamará o  macro recursivamente  para o
<code>cdr</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[macro_export]</span>
<span style="color: #c586c0;">macro_rules!</span> maj_list {
    (<span style="color: #9cdcfe;">$x</span>:expr) =&gt; (<span style="color: #4ec9b0;">Maj</span>::cons($x, <span style="color: #4ec9b0;">Maj</span>::nil()));

    (<span style="color: #9cdcfe;">$x</span>:expr, $(<span style="color: #9cdcfe;">$y</span>:expr),+) =&gt; (
            <span style="color: #4ec9b0;">Maj</span>::cons($x, <span style="color: #c586c0;">maj_list!</span>($($y),+))
    )
}
</pre>
</div>

<p>
Munidos dessa nova  notação, podemos reescrever o  exemplo anterior de
forma simplificada e muito mais didática:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6a9955;">// </span><span style="color: #6a9955;">Exemplo</span>
<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>));
</pre>
</div>
</div>
</div>
