04-02-tipos-de-dados-fundamentais.org
* Macro Rust para listas pontuadas

Outra  ideia interessante  é termos  macros para  listas pontuadas  de
objetos -- em  outras palavras, listas que não terminam  com o símbolo
~nil~:

#+begin_example
(a . (b . (c . d)))
#+end_example

Esse tipo de lista pode  ser escrita utilizando uma sintaxe abreviada,
da seguinte forma:

#+begin_example
(a b c . d)
#+end_example

Veja que esse tipo de lista difere-se da anterior pelo fato de não ser
uma  lista adequada,  ou seja,  não  ter seu  último /cons/  com um  ~cdr~
equivalente a ~nil~.

Para criar  um macro capaz  de gerar  esse tipo de  estrutura, podemos
basear-nos no  macro para  listas adequadas  e descrever  as seguintes
regras:

1. Estamos  tratando, dessa vez, de  uma lista formada por  /pelo menos/
   dois  elementos. No  caso de  lidarmos com  apenas dois  elementos,
   faremos um par com eles, através de uma célula /cons/;
2. Caso estejamos  tratando de mais de dois  elementos, basta criarmos
   uma célula /cons/  tal que seu ~car~ seja o  primeiro elemento da lista
   dada, e  o ~cdr~ seja  tratado recursivamente pelo nosso  macro, como
   feito no anterior;
3. Não  há tratamento  válido para apenas  um elemento;  tal tentativa
   constitui sintaxe inválida.

Expostas  essas considerações,  a implementação  do macro  para listas
pontuadas passa a ser trivial:

#+begin_src rust
#[macro_export]
macro_rules! maj_dotted_list {
    ($x:expr, $y:expr) => (Maj::cons($x, $y));

    ($x:expr, $y:expr, $($z:expr),+) => (
	    Maj::cons($x, maj_dotted_list!($y, $($z),+))
    )
}
#+end_src

O aspecto mais interessante da  criação de uma lista pontuada, através
do nosso macro recém-criado ~maj_dotted_list!~, é que esse macro auxilia
no processo de /anexação/ de listas a outras.

Por exemplo, suponhamos a função ~err~.  O retorno dessa função pode ser
visto como adequando-se ao formato

#+begin_example
(lit error fmt . rest)
#+end_example

em outras palavras,  a lista inicia-se com os símbolos  ~lit~ e ~error~, e
então com  uma string  de formato chamada  ~fmt~. Após  esses elementos,
podem vir nenhum  ou mais elementos, que serão  utiizados na impressão
da mensagem de erro, sendo estes relacionados à string ~fmt~.

Em  Rust, a  implementação da  função ~err~  (a ser  discutida em  outro
lugar)  envolve receber  os objetos  ~fmt~  e ~rest~  como parâmetro.  ~fmt~
deverá ser obrigatoriamente  uma string, mas ~rest~ nada mais  é que uma
lista de outros objetos quaisquer, que será /anexada/ ao fim do literal.

Essa  operação de  /anexação/ poderá  ser feita  com extrema  facilidade
usando nosso novo macro:

#+begin_src rust :tangle no
// Exemplo
maj_dotted_list!(Maj::lit(),
                 Maj::error(),
                 fmt,
                 rest);
#+end_src

Suponhamos que ~fmt~  seja um texto qualquer como ~"foo"~  e que ~rest~ seja
uma  lista  ~(a b c)~.  Esta operação  produzirá,  então,  o  seguinte
resultado:

#+begin_example
(lit error "foo" . (a b c))
#+end_example

Pela regra de confecção de listas, como o último par colocado na lista
pontuada também é uma lista,  podemos reescrever a lista pontuada como
a lista adequada que acabou por tornar-se:

#+begin_example
(lit error "foo" a b c)
#+end_example

* Números

Em Majestic  Lisp, o número é  um tipo /opaco/, a  princípio. Porém, sua
implementação envolve um sistema elaborado  de subtipos, que podem ser
fabricados com  o mesmo  sistema de estruturas  de dados  associadas a
elementos de uma enumeração.  Aqui, escolhemos implementá-los seguindo
as regras abaixo:

- Um  número  /inteiro/  (~MajNumber::Integer~) constitui-se  de  um  mero
  número inteiro, com sinal, de 64 bits;
- Um /ponto flutuante/ (~MajNumber::Float~)  constitui-se de um mero ponto
  flutuante de 64 bits;
- Uma  /fração/  (~MajNumber::Fraction~)   constitui-se  de  dois  números
  inteiros, com sinal, de 64 bits;
- Um   número  /complexo/   (~MajNumber::Complex~)  constitui-se   de  uma
  estrutura de  dados, que  armazena recursivamente  outros ~MajNumber~,
  gerenciados pelo coletor de lixo.

#+begin_src rust
#[derive(Debug, Trace, Finalize, Clone)]
pub enum MajNumber {
    Integer(i64),
    Float(f64),
    Fraction(i64, i64),
    Complex {
        real: Gc<MajNumber>,
        imag: Gc<MajNumber>
    }
}
#+end_src

Todos os subtipos enumerados possuem implementação trivial do ponto de
vista de dados. Todavia, ~MajNumber::Complex~ requererá um pouco mais de
cuidado durante  sua fabricação,  uma vez que  *um número  complexo não
pode* ser constituído recursivamente de outros números complexos.

