doc/html/04-02-tipos-de-dados-fundamentais.html

<div id="outline-container-org2323be0" class="outline-2">
<h2 id="org2323be0"><span class="section-number-2">7.</span> Macro Rust para listas pontuadas</h2>
<div class="outline-text-2" id="text-7">
<p>
Outra  ideia interessante  é termos  macros para  listas pontuadas  de
objetos &#x2013; em  outras palavras, listas que não terminam  com o símbolo
<code>nil</code>:
</p>

<pre class="example" id="org0fda5d6">
(a . (b . (c . d)))
</pre>

<p>
Esse tipo de lista pode  ser escrita utilizando uma sintaxe abreviada,
da seguinte forma:
</p>

<pre class="example" id="org51bfd65">
(a b c . d)
</pre>

<p>
Veja que esse tipo de lista difere-se da anterior pelo fato de não ser
uma  lista adequada,  ou seja,  não  ter seu  último <i>cons</i>  com um  <code>cdr</code>
equivalente a <code>nil</code>.
</p>

<p>
Para criar  um macro capaz  de gerar  esse tipo de  estrutura, podemos
basear-nos no  macro para  listas adequadas  e descrever  as seguintes
regras:
</p>

<ol class="org-ol">
<li>Estamos  tratando, dessa vez, de  uma lista formada por  <i>pelo menos</i>
dois  elementos. No  caso de  lidarmos com  apenas dois  elementos,
faremos um par com eles, através de uma célula <i>cons</i>;</li>
<li>Caso estejamos  tratando de mais de dois  elementos, basta criarmos
uma célula <i>cons</i>  tal que seu <code>car</code> seja o  primeiro elemento da lista
dada, e  o <code>cdr</code> seja  tratado recursivamente pelo nosso  macro, como
feito no anterior;</li>
<li>Não  há tratamento  válido para apenas  um elemento;  tal tentativa
constitui sintaxe inválida.</li>
</ol>

<p>
Expostas  essas considerações,  a implementação  do macro  para listas
pontuadas passa a ser trivial:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[macro_export]</span>
<span style="color: #c586c0;">macro_rules!</span> maj_dotted_list {
    (<span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$y</span>:expr) =&gt; (<span style="color: #4ec9b0;">Maj</span>::cons($x, $y));

    (<span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$y</span>:expr, $(<span style="color: #9cdcfe;">$z</span>:expr),+) =&gt; (
            <span style="color: #4ec9b0;">Maj</span>::cons($x, <span style="color: #c586c0;">maj_dotted_list!</span>($y, $($z),+))
    )
}
</pre>
</div>

<p>
O aspecto mais interessante da  criação de uma lista pontuada, através
do nosso macro recém-criado <code>maj_dotted_list!</code>, é que esse macro auxilia
no processo de <i>anexação</i> de listas a outras.
</p>

<p>
Por exemplo, suponhamos a função <code>err</code>.  O retorno dessa função pode ser
visto como adequando-se ao formato
</p>

<pre class="example" id="org7895422">
(lit error fmt . rest)
</pre>

<p>
em outras palavras,  a lista inicia-se com os símbolos  <code>lit</code> e <code>error</code>, e
então com  uma string  de formato chamada  <code>fmt</code>. Após  esses elementos,
podem vir nenhum  ou mais elementos, que serão  utiizados na impressão
da mensagem de erro, sendo estes relacionados à string <code>fmt</code>.
</p>

<p>
Em  Rust, a  implementação da  função <code>err</code>  (a ser  discutida em  outro
lugar)  envolve receber  os objetos  <code>fmt</code>  e <code>rest</code>  como parâmetro.  <code>fmt</code>
deverá ser obrigatoriamente  uma string, mas <code>rest</code> nada mais  é que uma
lista de outros objetos quaisquer, que será <i>anexada</i> ao fim do literal.
</p>

<p>
Essa  operação de  <i>anexação</i> poderá  ser feita  com extrema  facilidade
usando nosso novo macro:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6a9955;">// </span><span style="color: #6a9955;">Exemplo</span>
<span style="color: #c586c0;">maj_dotted_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(),
                 <span style="color: #4ec9b0;">Maj</span>::error(),
                 fmt,
                 rest);
</pre>
</div>

<p>
Suponhamos que <code>fmt</code>  seja um texto qualquer como <code>"foo"</code>  e que <code>rest</code> seja
uma  lista  <code>(a b c)</code>.  Esta operação  produzirá,  então,  o  seguinte
resultado:
</p>

<pre class="example" id="orgf16dff3">
(lit error "foo" . (a b c))
</pre>

<p>
Pela regra de confecção de listas, como o último par colocado na lista
pontuada também é uma lista,  podemos reescrever a lista pontuada como
a lista adequada que acabou por tornar-se:
</p>

<pre class="example" id="org7cde4ba">
(lit error "foo" a b c)
</pre>
</div>
</div>

<div id="outline-container-org232d99b" class="outline-2">
<h2 id="org232d99b"><span class="section-number-2">8.</span> Números</h2>
<div class="outline-text-2" id="text-8">
<p>
Em Majestic  Lisp, o número é  um tipo <i>opaco</i>, a  princípio. Porém, sua
implementação envolve um sistema elaborado  de subtipos, que podem ser
fabricados com  o mesmo  sistema de estruturas  de dados  associadas a
elementos de uma enumeração.  Aqui, escolhemos implementá-los seguindo
as regras abaixo:
</p>

<ul class="org-ul">
<li>Um  número  <i>inteiro</i>  (<code>MajNumber::Integer</code>) constitui-se  de  um  mero
número inteiro, com sinal, de 64 bits;</li>
<li>Um <i>ponto flutuante</i> (<code>MajNumber::Float</code>)  constitui-se de um mero ponto
flutuante de 64 bits;</li>
<li>Uma  <i>fração</i>  (<code>MajNumber::Fraction</code>)   constitui-se  de  dois  números
inteiros, com sinal, de 64 bits;</li>
<li>Um   número  <i>complexo</i>   (<code>MajNumber::Complex</code>)  constitui-se   de  uma
estrutura de  dados, que  armazena recursivamente  outros <code>MajNumber</code>,
gerenciados pelo coletor de lixo.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Debug, Trace, Finalize, Clone)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">MajNumber</span> {
    <span style="color: #4ec9b0;">Integer</span>(<span style="color: #4ec9b0;">i64</span>),
    <span style="color: #4ec9b0;">Float</span>(<span style="color: #4ec9b0;">f64</span>),
    <span style="color: #4ec9b0;">Fraction</span>(<span style="color: #4ec9b0;">i64</span>, <span style="color: #4ec9b0;">i64</span>),
    <span style="color: #4ec9b0;">Complex</span> {
        <span style="color: #9cdcfe;">real</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">MajNumber</span>&gt;,
        <span style="color: #9cdcfe;">imag</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">MajNumber</span>&gt;
    }
}
</pre>
</div>

<p>
Todos os subtipos enumerados possuem implementação trivial do ponto de
vista de dados. Todavia, <code>MajNumber::Complex</code> requererá um pouco mais de
cuidado durante  sua fabricação,  uma vez que  <b>um número  complexo não
pode</b> ser constituído recursivamente de outros números complexos.
</p>
</div>
</div>
