04-02-tipos-de-dados-fundamentais.org
* Construtores de números

À exceção de ~MajNumber::Complex~, a  construção dos subtipos de números
é trivial.

Podemos adicionar diretamente a ~Maj~ mais alguns métodos estáticos para
a  construção desses  elementos. Começaremos  com a  construção de  um
número inteiro, que é trivial.

#+begin_src rust
impl Maj {
    pub fn integer(num: i64) -> Gc<Maj> {
        Gc::new(Maj::Number(MajNumber::Integer(num)))
    }
}
#+end_src

O segundo método  estático de construção será o de  um ponto flutuante
que, assim como no caso dos inteiros, também é trivial.

#+begin_src rust
impl Maj {
    pub fn float(num: f64) -> Gc<Maj> {
        Gc::new(Maj::Number(MajNumber::Float(num)))
    }
}
#+end_src

A  fração requer  um  pouco mais  de  escrita, mas  não  deixa de  ser
igualmente simples. Aqui, tomamos numerador e denominador como números
inteiros simples.

#+begin_src rust
impl Maj {
    pub fn fraction(numer: i64, denom: i64) -> Gc<Maj> {
        Gc::new(Maj::Number(MajNumber::Fraction(numer, denom)))
    }
}
#+end_src

Já  no caso  dos números  complexos,  precisaremos tomar  um pouco  de
cuidado. Se alguma das partes informadas (/real/ ou /imaginária/) for, por
si, um outro número complexo, *a aplicação entrará em pânico*, pois este
será   um   indicativo   de    construção   absurda   de   um   número
complexo. Ademais,  o mesmo deverá  ocorrer quando um  número complexo
for construído a partir de elementos que não sejam números.

# TODO: Talvez seja legal construir o complexo por cópia.
Caso as componentes  do número complexo sejam  elementos válidos, será
criado  um novo  número  complexo, usando  os  números fornecidos  /por
referência/:   ou  seja,   os   valores   fornecidos  são   diretamente
reutilizados, do ponto de vista do coletor de lixo, e não copiados.

A aplicação entra  em pânico nos casos supracitados  por constituir um
erro vindo  do programador em  si, através de construção  incorreta do
programa,  e  não  do  usuário da  linguagem:  qualquer  tentativa  de
construir   números   complexos   usando  objetos   não-numéricos   ou
componentes  complexos   será  interpretado  como  erro   de  sintaxe,
portanto, essas situações nunca deverão  ocorrer em tempo de execução,
a não ser de forma proposital.

#+begin_src rust
impl Maj {
    pub fn complex(r: Gc<Maj>, i: Gc<Maj>) -> Gc<Maj> {
        use crate::axioms::predicates::maj_complexp;

        let r_complexp = maj_complexp(r.clone()).to_bool();
        let i_complexp = maj_complexp(i.clone()).to_bool();

        if r_complexp || i_complexp {
            panic!("Complex cannot have complex parts");
        }

        if let Maj::Number(rc) = &*r.clone() {
            if let Maj::Number(ic) = &*i.clone() {
                return Gc::new(
                    Maj::Number(MajNumber::Complex {
                        real: Gc::new(rc.clone()),
                        imag: Gc::new(ic.clone())
                    }));
            } else {};
        } else {};

        panic!("Complex cannot have non-numeric parts");
    }
}
#+end_src

