doc/html/04-02-tipos-de-dados-fundamentais.html

<div id="outline-container-org21695d9" class="outline-2">
<h2 id="org21695d9"><span class="section-number-2">9.</span> Construtores de números</h2>
<div class="outline-text-2" id="text-9">
<p>
À exceção de <code>MajNumber::Complex</code>, a  construção dos subtipos de números
é trivial.
</p>

<p>
Podemos adicionar diretamente a <code>Maj</code> mais alguns métodos estáticos para
a  construção desses  elementos. Começaremos  com a  construção de  um
número inteiro, que é trivial.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">integer</span>(<span style="color: #9cdcfe;">num</span>: <span style="color: #4ec9b0;">i64</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(<span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Integer</span>(num)))
    }
}
</pre>
</div>

<p>
O segundo método  estático de construção será o de  um ponto flutuante
que, assim como no caso dos inteiros, também é trivial.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">float</span>(<span style="color: #9cdcfe;">num</span>: <span style="color: #4ec9b0;">f64</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(<span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Float</span>(num)))
    }
}
</pre>
</div>

<p>
A  fração requer  um  pouco mais  de  escrita, mas  não  deixa de  ser
igualmente simples. Aqui, tomamos numerador e denominador como números
inteiros simples.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">fraction</span>(<span style="color: #9cdcfe;">numer</span>: <span style="color: #4ec9b0;">i64</span>, <span style="color: #9cdcfe;">denom</span>: <span style="color: #4ec9b0;">i64</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(<span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Fraction</span>(numer, denom)))
    }
}
</pre>
</div>

<p>
Já  no caso  dos números  complexos,  precisaremos tomar  um pouco  de
cuidado. Se alguma das partes informadas (<i>real</i> ou <i>imaginária</i>) for, por
si, um outro número complexo, <b>a aplicação entrará em pânico</b>, pois este
será   um   indicativo   de    construção   absurda   de   um   número
complexo. Ademais,  o mesmo deverá  ocorrer quando um  número complexo
for construído a partir de elementos que não sejam números.
</p>

<p>
Caso as componentes  do número complexo sejam  elementos válidos, será
criado  um novo  número  complexo, usando  os  números fornecidos  <i>por
referência</i>:   ou  seja,   os   valores   fornecidos  são   diretamente
reutilizados, do ponto de vista do coletor de lixo, e não copiados.
</p>

<p>
A aplicação entra  em pânico nos casos supracitados  por constituir um
erro vindo  do programador em  si, através de construção  incorreta do
programa,  e  não  do  usuário da  linguagem:  qualquer  tentativa  de
construir   números   complexos   usando  objetos   não-numéricos   ou
componentes  complexos   será  interpretado  como  erro   de  sintaxe,
portanto, essas situações nunca deverão  ocorrer em tempo de execução,
a não ser de forma proposital.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">complex</span>(<span style="color: #9cdcfe;">r</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">i</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_complexp;

        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">r_complexp</span> = maj_complexp(r.clone()).to_bool();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">i_complexp</span> = maj_complexp(i.clone()).to_bool();

        <span style="color: #569cd6;">if</span> r_complexp || i_complexp {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Complex cannot have complex parts"</span>);
        }

        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(rc) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*r.clone() {
            <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(ic) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*i.clone() {
                <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Gc</span>::new(
                    <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(<span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
                        <span style="color: #9cdcfe;">real</span>: <span style="color: #4ec9b0;">Gc</span>::new(rc.clone()),
                        <span style="color: #9cdcfe;">imag</span>: <span style="color: #4ec9b0;">Gc</span>::new(ic.clone())
                    }));
            } <span style="color: #569cd6;">else</span> {};
        } <span style="color: #569cd6;">else</span> {};

        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Complex cannot have non-numeric parts"</span>);
    }
}
</pre>
</div>
</div>
</div>
