04-02-tipos-de-dados-fundamentais.org
* Conversões para tipos numéricos

Outra coisa  interessante a se  ter na interface de  comunicação entre
objetos Majestic Lisp e Rust são funções que convertam automaticamente
alguns objetos para valores nativos de Rust.

Algo   extremamente    valoroso   de   se   tratar    são   os   tipos
numéricos.  Primeiramente,  criemos  uma função,  visível  apenas  aos
métodos de ~Maj~, que converta um objeto ~Maj~ para um ~MajNumber~; todavia,
isso só será  feito caso for possível, como sugere  o retorno do valor
dentro de um ~Option~.

#+begin_src rust
impl Maj {
    fn to_maj_number(x: &Maj) -> Option<MajNumber> {
        if let Maj::Number(num) = x {
            Some(num.clone())
        } else {
            None
        }
    }
}
#+end_src

A  conversão de  ~Maj~  para inteiro  (~i64~) e  ponto  flutuante (~f64~)  é
trivial. Usamos  o método definido  previamente, e retornamos  o valor
associado, mas apenas se for possível; novamente, temos aqui o retorno
de um ~Option~.

#+begin_src rust
impl Maj {
    pub fn to_integer(&self) -> Option<i64> {
        match Maj::to_maj_number(self) {
            Some(num) => {
                if let MajNumber::Integer(n) = num {
                    return Some(n);
                } else {};
            }
            None => {},
        };
        None
    }

    pub fn to_float(&self) -> Option<f64> {
        match Maj::to_maj_number(self) {
            Some(num) => {
                if let MajNumber::Float(n) = num {
                    return Some(n);
                } else {};
            },
            None => {},
        };
        None
    }
}
#+end_src

No caso das frações, que são compostas unicamente de um /numerador/ e um
/denominador/, cada qual sendo um  número /inteiro/ (~i64~), convém retornar
um par (tupla  de dois elementos) -- novamente, isso  só será feito se
for possível, portanto retornamos um ~Option~.

#+begin_src rust
impl Maj {
    pub fn to_fraction(&self) -> Option<(i64, i64)> {
        match Maj::to_maj_number(self) {
            Some(num) => {
                if let MajNumber::Fraction(n, d) = num {
                    return Some((n, d));
                } else {};
            },
            None => {},
        };
        None
    }
}
#+end_src

Podemos  também  /forçar/  a  conversão  de uma  fração  para  um  ponto
flutuante. Para tanto, basta que realizemos coerções de tipos.

Por conveniência, faremos com que esse método realize conversão para
ponto flutuante a  partir de todos os outros tipos  de números (exceto
para  números   complexos,  pois  essa  manipulação   não  fará  muito
sentido).

#+begin_src rust
impl MajNumber {
    pub fn into_float(&self) -> f64 {
        match self {
            MajNumber::Integer(n) => {
                *n as f64
            },
            MajNumber::Float(n) => {
                *n
            },
            MajNumber::Fraction(n, d) => {
                *n as f64 / *d as f64
            },
            MajNumber::Complex {
                real: _,
                imag: _
            } => {
                panic!("Cannot convert complex to float");
            }
        }
    }
}

impl Maj {
    pub fn to_forced_float(&self) -> Option<f64> {
        match Maj::to_maj_number(self) {
            Some(num) => Some(num.into_float()),
            None => None,
        }
    }
}
#+end_src

Finalmente,  faremos a  conversão  de um  número  complexo para  algum
objeto  de Rust  que  possa carregá-lo.  Aqui,  optamos por  converter
forçadamente cada  uma de suas partes  em /floats/. Isso pode  ser feito
com o método anteriormente definido.

#+begin_src rust
impl Maj {
    pub fn to_complex(&self) -> Option<(f64, f64)> {
        match Maj::to_maj_number(self) {
            Some(num) => {
                let num = num.clone();
                if let MajNumber::Complex {
                    real, imag
                } = &num {
                    let rreal = (*real.clone()).into_float();
                    let rimag = (*imag.clone()).into_float();
                    return Some((rreal, rimag));
                } else {};
            },
            None => {},
        }
        None
    }
}
#+end_src

