doc/html/04-02-tipos-de-dados-fundamentais.html

<div id="outline-container-org004cd7b" class="outline-2">
<h2 id="org004cd7b"><span class="section-number-2">10.</span> Conversões para tipos numéricos</h2>
<div class="outline-text-2" id="text-10">
<p>
Outra coisa  interessante a se  ter na interface de  comunicação entre
objetos Majestic Lisp e Rust são funções que convertam automaticamente
alguns objetos para valores nativos de Rust.
</p>

<p>
Algo   extremamente    valoroso   de   se   tratar    são   os   tipos
numéricos.  Primeiramente,  criemos  uma função,  visível  apenas  aos
métodos de <code>Maj</code>, que converta um objeto <code>Maj</code> para um <code>MajNumber</code>; todavia,
isso só será  feito caso for possível, como sugere  o retorno do valor
dentro de um <code>Option</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_maj_number</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">Maj</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">MajNumber</span>&gt; {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) = x {
            <span style="color: #4ec9b0;">Some</span>(num.clone())
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">None</span>
        }
    }
}
</pre>
</div>

<p>
A  conversão de  <code>Maj</code>  para inteiro  (<code>i64</code>) e  ponto  flutuante (<code>f64</code>)  é
trivial. Usamos  o método definido  previamente, e retornamos  o valor
associado, mas apenas se for possível; novamente, temos aqui o retorno
de um <code>Option</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_integer</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">i64</span>&gt; {
        <span style="color: #569cd6;">match</span> <span style="color: #4ec9b0;">Maj</span>::to_maj_number(<span style="color: #569cd6;">self</span>) {
            <span style="color: #4ec9b0;">Some</span>(num) =&gt; {
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Integer</span>(n) = num {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Some</span>(n);
                } <span style="color: #569cd6;">else</span> {};
            }
            <span style="color: #4ec9b0;">None</span> =&gt; {},
        };
        <span style="color: #4ec9b0;">None</span>
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_float</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">f64</span>&gt; {
        <span style="color: #569cd6;">match</span> <span style="color: #4ec9b0;">Maj</span>::to_maj_number(<span style="color: #569cd6;">self</span>) {
            <span style="color: #4ec9b0;">Some</span>(num) =&gt; {
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Float</span>(n) = num {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Some</span>(n);
                } <span style="color: #569cd6;">else</span> {};
            },
            <span style="color: #4ec9b0;">None</span> =&gt; {},
        };
        <span style="color: #4ec9b0;">None</span>
    }
}
</pre>
</div>

<p>
No caso das frações, que são compostas unicamente de um <i>numerador</i> e um
<i>denominador</i>, cada qual sendo um  número <i>inteiro</i> (<code>i64</code>), convém retornar
um par (tupla  de dois elementos) &#x2013; novamente, isso  só será feito se
for possível, portanto retornamos um <code>Option</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_fraction</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;(<span style="color: #4ec9b0;">i64</span>, <span style="color: #4ec9b0;">i64</span>)&gt; {
        <span style="color: #569cd6;">match</span> <span style="color: #4ec9b0;">Maj</span>::to_maj_number(<span style="color: #569cd6;">self</span>) {
            <span style="color: #4ec9b0;">Some</span>(num) =&gt; {
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Fraction</span>(n, d) = num {
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Some</span>((n, d));
                } <span style="color: #569cd6;">else</span> {};
            },
            <span style="color: #4ec9b0;">None</span> =&gt; {},
        };
        <span style="color: #4ec9b0;">None</span>
    }
}
</pre>
</div>

<p>
Podemos  também  <i>forçar</i>  a  conversão  de uma  fração  para  um  ponto
flutuante. Para tanto, basta que realizemos coerções de tipos.
</p>

<p>
Por conveniência, faremos com que esse método realize conversão para
ponto flutuante a  partir de todos os outros tipos  de números (exceto
para  números   complexos,  pois  essa  manipulação   não  fará  muito
sentido).
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajNumber</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">into_float</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">f64</span> {
        <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">self</span> {
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Integer</span>(n) =&gt; {
                *n <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">f64</span>
            },
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Float</span>(n) =&gt; {
                *n
            },
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Fraction</span>(n, d) =&gt; {
                *n <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">f64</span> / *d <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">f64</span>
            },
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
                <span style="color: #9cdcfe;">real</span>: _,
                <span style="color: #9cdcfe;">imag</span>: _
            } =&gt; {
                <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Cannot convert complex to float"</span>);
            }
        }
    }
}

<span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_forced_float</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">f64</span>&gt; {
        <span style="color: #569cd6;">match</span> <span style="color: #4ec9b0;">Maj</span>::to_maj_number(<span style="color: #569cd6;">self</span>) {
            <span style="color: #4ec9b0;">Some</span>(num) =&gt; <span style="color: #4ec9b0;">Some</span>(num.into_float()),
            <span style="color: #4ec9b0;">None</span> =&gt; <span style="color: #4ec9b0;">None</span>,
        }
    }
}
</pre>
</div>

<p>
Finalmente,  faremos a  conversão  de um  número  complexo para  algum
objeto  de Rust  que  possa carregá-lo.  Aqui,  optamos por  converter
forçadamente cada  uma de suas partes  em <i>floats</i>. Isso pode  ser feito
com o método anteriormente definido.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_complex</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;(<span style="color: #4ec9b0;">f64</span>, <span style="color: #4ec9b0;">f64</span>)&gt; {
        <span style="color: #569cd6;">match</span> <span style="color: #4ec9b0;">Maj</span>::to_maj_number(<span style="color: #569cd6;">self</span>) {
            <span style="color: #4ec9b0;">Some</span>(num) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">num</span> = num.clone();
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> {
                    real, imag
                } = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>num {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">rreal</span> = (*real.clone()).into_float();
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">rimag</span> = (*imag.clone()).into_float();
                    <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Some</span>((rreal, rimag));
                } <span style="color: #569cd6;">else</span> {};
            },
            <span style="color: #4ec9b0;">None</span> =&gt; {},
        }
        <span style="color: #4ec9b0;">None</span>
    }
}
</pre>
</div>
</div>
</div>
