04-02-tipos-de-dados-fundamentais.org
* Conversão para string

É igualmente conveniente que tenhamos alguns recursos para transformar
um objeto ~Maj~ para strings de Rust propriamente ditas.

Strings nada mais são que vetores de caracteres. Em sua implementação,
armazenamo-nas utilizando a estrutura ~String~ de Rust.

Caso o  objeto ~x~ em  questão seja exatamente  um ~vector~ cujo  tipo dos
elementos seja  uniformemente ~char~,  retornaremos ~Some~ associado  a um
clone da ~String~  utilizada na implementação. Caso  esta comparação não
se enquadre, retornamos ~None~.

#+begin_src rust
fn maj_to_string(x: Gc<Maj>) -> Option<String> {
    if let Maj::Vector(vv) = &*x {
        if let MajVector::Char(s) = &vv {
            Some(s.borrow().clone())
        } else {
            None
        }
    } else {
        None
    }
}
#+end_src

Finalmente, o método ~Maj::stringify~  (diferente de ~Maj::to_string~, que
é automaticamente implementado com a  formatação simples de objetos, a
ser discutida em outra seção) clona ~self~ para que seja gerenciado pelo
coletor  de lixo,  e então  invoca ~maj_to_string~  para que  o trabalho
pesado seja feito.

#+begin_src rust
impl Maj {
    pub fn stringify(&self) -> Option<String> {
        maj_to_string(Gc::new(self.clone()))
    }
}
#+end_src

* TODO Conversão para caractere

#+begin_src rust
impl Maj {
    pub fn to_char(&self) -> Option<char> {
        if let Maj::Char(c) = &*self {
            Some(*c)
        } else {
            None
        }
    }
}
#+end_src

* Recuperação de símbolo cru

#+begin_src rust
impl Maj {
    pub fn to_raw_sym(&self) -> Option<u64> {
        match *self {
            Maj::Sym(n) => Some(n),
            _ => None
        }
    }
}
#+end_src

* TODO Streams

/Streams/ são um tipo de objeto em construção. Mais será dito a respeito
deles  no   futuro,  quando  forem  efetivamente   implementados.  Por
enquanto, o código a seguir serve de espaço reservado.

# Usar std::os::unix::io::{ FromRawFd, IntoRawFd }
# Usar std::os::windows::io::{ FromRawHandle, IntoRawHandle }

# Considere os links:
# https://doc.rust-lang.org/std/os/unix/io/index.html
# https://doc.rust-lang.org/std/os/windows/io/index.html

#+begin_src rust
#[derive(Trace, Finalize, Debug, Clone, PartialEq)]
pub enum MajStreamDirection {
    In,
    Out
}
#+end_src

#+begin_src rust
#[derive(Trace, Finalize, Debug, Clone, PartialEq)]
pub enum MajStreamType {
    File,
    Stdin,
    Stdout,
    Stderr
}
#+end_src

#+begin_src rust
#[derive(Debug, Trace, Finalize, Clone)]
pub struct MajStream {
    pub direction: MajStreamDirection,
    pub handle:    usize,
    pub stype:     MajStreamType
}
#+end_src

#+begin_src rust
impl MajStream {
    pub fn is_internal(&self) -> bool {
        self.stype != MajStreamType::File
    }
}
#+end_src

#+begin_src rust :tangle no
// Para referência futura
#[derive(Trace, Finalize)]
struct MeuArquivo {
    #[unsafe_ignore_trace]
    inner: std::fs::File,
}
#+end_src

#+begin_src rust
impl Maj {
    pub fn stream(state: &mut MajState,
                  file: &str,
                  dir: MajStreamDirection
    ) -> Option<Gc<Maj>> {
        state.make_stream(file, dir)
    }
}
#+end_src


* Impressão simples

#+begin_src rust
use std::fmt;
#+end_src

