doc/html/04-02-tipos-de-dados-fundamentais.html

<div id="outline-container-org2a3a403" class="outline-2">
<h2 id="org2a3a403"><span class="section-number-2">11.</span> Conversão para string</h2>
<div class="outline-text-2" id="text-11">
<p>
É igualmente conveniente que tenhamos alguns recursos para transformar
um objeto <code>Maj</code> para strings de Rust propriamente ditas.
</p>

<p>
Strings nada mais são que vetores de caracteres. Em sua implementação,
armazenamo-nas utilizando a estrutura <code>String</code> de Rust.
</p>

<p>
Caso o  objeto <code>x</code> em  questão seja exatamente  um <code>vector</code> cujo  tipo dos
elementos seja  uniformemente <code>char</code>,  retornaremos <code>Some</code> associado  a um
clone da <code>String</code>  utilizada na implementação. Caso  esta comparação não
se enquadre, retornamos <code>None</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_to_string</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">String</span>&gt; {
    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vv) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*x {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>vv {
            <span style="color: #4ec9b0;">Some</span>(s.borrow().clone())
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">None</span>
        }
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">None</span>
    }
}
</pre>
</div>

<p>
Finalmente, o método <code>Maj::stringify</code>  (diferente de <code>Maj::to_string</code>, que
é automaticamente implementado com a  formatação simples de objetos, a
ser discutida em outra seção) clona <code>self</code> para que seja gerenciado pelo
coletor  de lixo,  e então  invoca <code>maj_to_string</code>  para que  o trabalho
pesado seja feito.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">stringify</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">String</span>&gt; {
        maj_to_string(<span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #569cd6;">self</span>.clone()))
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5a10c7" class="outline-2">
<h2 id="orgf5a10c7"><span class="section-number-2">12.</span> <span class="todo TODO">TODO</span> Conversão para caractere</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_char</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">char</span>&gt; {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(c) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*<span style="color: #569cd6;">self</span> {
            <span style="color: #4ec9b0;">Some</span>(*c)
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #4ec9b0;">None</span>
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f0ea66" class="outline-2">
<h2 id="org3f0ea66"><span class="section-number-2">13.</span> Recuperação de símbolo cru</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">to_raw_sym</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">u64</span>&gt; {
        <span style="color: #569cd6;">match</span> *<span style="color: #569cd6;">self</span> {
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(n) =&gt; <span style="color: #4ec9b0;">Some</span>(n),
            _ =&gt; <span style="color: #4ec9b0;">None</span>
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeae756c" class="outline-2">
<h2 id="orgeae756c"><span class="section-number-2">14.</span> <span class="todo TODO">TODO</span> Streams</h2>
<div class="outline-text-2" id="text-14">
<p>
<i>Streams</i> são um tipo de objeto em construção. Mais será dito a respeito
deles  no   futuro,  quando  forem  efetivamente   implementados.  Por
enquanto, o código a seguir serve de espaço reservado.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Trace, Finalize, Debug, Clone, PartialEq)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">MajStreamDirection</span> {
    <span style="color: #4ec9b0;">In</span>,
    <span style="color: #4ec9b0;">Out</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Trace, Finalize, Debug, Clone, PartialEq)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">MajStreamType</span> {
    <span style="color: #4ec9b0;">File</span>,
    <span style="color: #4ec9b0;">Stdin</span>,
    <span style="color: #4ec9b0;">Stdout</span>,
    <span style="color: #4ec9b0;">Stderr</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Debug, Trace, Finalize, Clone)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">MajStream</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #9cdcfe;">direction</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>,
    <span style="color: #569cd6;">pub</span> <span style="color: #9cdcfe;">handle</span>:    <span style="color: #4ec9b0;">usize</span>,
    <span style="color: #569cd6;">pub</span> <span style="color: #9cdcfe;">stype</span>:     <span style="color: #4ec9b0;">MajStreamType</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">MajStream</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">is_internal</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>) -&gt; <span style="color: #4ec9b0;">bool</span> {
        <span style="color: #569cd6;">self</span>.stype != <span style="color: #4ec9b0;">MajStreamType</span>::<span style="color: #4ec9b0;">File</span>
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6a9955;">// </span><span style="color: #6a9955;">Para refer&#234;ncia futura</span>
<span style="color: #c586c0;">#[derive(Trace, Finalize)]</span>
<span style="color: #569cd6;">struct</span> <span style="color: #4ec9b0;">MeuArquivo</span> {
    <span style="color: #c586c0;">#[unsafe_ignore_trace]</span>
    <span style="color: #9cdcfe;">inner</span>: <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">fs</span>::<span style="color: #4ec9b0;">File</span>,
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">stream</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                  <span style="color: #9cdcfe;">file</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>,
                  <span style="color: #9cdcfe;">dir</span>: <span style="color: #4ec9b0;">MajStreamDirection</span>
    ) -&gt; <span style="color: #4ec9b0;">Option</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
        state.make_stream(file, dir)
    }
}
</pre>
</div>
</div>
</div>
