04-02-tipos-de-dados-fundamentais.org
** Impressão simples de objetos

#+begin_src rust
impl fmt::Display for Maj {
    fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
        match self {
            Maj::Sym(idx) => {
                write!(f, "~sym#{}", idx)
            },
            Maj::Cons { car, cdr } => {
                // Temporary cons cell display
                write!(f, "({} . {})", car, cdr)
            },
            Maj::Char(chr) =>
                write!(f, "~char##{}", *chr),
            Maj::Stream(_) => write!(f, "~stream"),
            Maj::Number(num) => write!(f, "{}", num),
            Maj::Vector(_) => write!(f, "~vector"),
        }
    }
}
#+end_src

Para símbolos, também é válido apontar  que sua forma textual pode ser
verificada sob um contexto.

#+begin_src rust
impl Maj {
    pub fn symbol_name(&self, state: &MajState) -> String {
        if let Maj::Sym(idx) = self {
            state.symbol_name(idx)
        } else {
            // Cannot give a symbol name to something
            // that is not a symbol... but..
            format!("~maj#{:?}", self)
        }
    }
}
#+end_src

** Impressão de números

#+begin_src rust
impl fmt::Display for MajNumber {
    fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
        match self {
            MajNumber::Integer(num) => write!(f, "{}", num),
            MajNumber::Float(num) => {
                use crate::axioms::utils::format_raw_float;
                write!(f, "{}", format_raw_float(*num))
            },
            MajNumber::Fraction(numer, denom) => {
                write!(f, "{}/{}", numer, denom)
            },
            MajNumber::Complex { real, imag } => {
                write!(f, "{}J{}", real, imag)
            }
        }
    }
}
#+end_src

