doc/html/04-02-tipos-de-dados-fundamentais.html


<div id="outline-container-org0f30903" class="outline-2">
<h2 id="org0f30903"><span class="section-number-2">15.</span> Impressão simples</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::fmt;
</pre>
</div>
</div>

<div id="outline-container-org0975106" class="outline-3">
<h3 id="org0975106"><span class="section-number-3">15.1.</span> Impressão simples de objetos</h3>
<div class="outline-text-3" id="text-15-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Display</span> <span style="color: #569cd6;">for</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">fmt</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">f</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Formatter</span>&lt;'<span style="color: #9cdcfe;">_</span>&gt;) -&gt; <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Result</span> {
        <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">self</span> {
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(idx) =&gt; {
                <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"~sym#</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, idx)
            },
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr } =&gt; {
                <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Temporary cons cell display</span>
                <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"(</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> . </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">)"</span>, car, cdr)
            },
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(chr) =&gt;
                <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"~char##</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, *chr),
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(_) =&gt; <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"~stream"</span>),
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Number</span>(num) =&gt; <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, num),
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(_) =&gt; <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"~vector"</span>),
        }
    }
}
</pre>
</div>

<p>
Para símbolos, também é válido apontar  que sua forma textual pode ser
verificada sob um contexto.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">symbol_name</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
        <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(idx) = <span style="color: #569cd6;">self</span> {
            state.symbol_name(idx)
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Cannot give a symbol name to something</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">that is not a symbol... but..</span>
            <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"~maj#</span><span style="color: #ce9178; font-style: italic;">{:?}</span><span style="color: #ce9178;">"</span>, <span style="color: #569cd6;">self</span>)
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orged1a990" class="outline-3">
<h3 id="orged1a990"><span class="section-number-3">15.2.</span> Impressão de números</h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Display</span> <span style="color: #569cd6;">for</span> <span style="color: #4ec9b0;">MajNumber</span> {
    <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">fmt</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">self</span>, <span style="color: #9cdcfe;">f</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Formatter</span>&lt;'<span style="color: #9cdcfe;">_</span>&gt;) -&gt; <span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Result</span> {
        <span style="color: #569cd6;">match</span> <span style="color: #569cd6;">self</span> {
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Integer</span>(num) =&gt; <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, num),
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Float</span>(num) =&gt; {
                <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::format_raw_float;
                <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, format_raw_float(*num))
            },
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Fraction</span>(numer, denom) =&gt; {
                <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">/</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, numer, denom)
            },
            <span style="color: #4ec9b0;">MajNumber</span>::<span style="color: #4ec9b0;">Complex</span> { real, imag } =&gt; {
                <span style="color: #c586c0;">write!</span>(f, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">J</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, real, imag)
            }
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
