04-02-tipos-de-dados-fundamentais.org
* Construtores de símbolos constantes

#+begin_src rust
use crate::axioms::MajRawSym;
use crate::axioms::utils::sym_from_raw;
#+end_src

#+begin_src rust
impl Maj {
    pub fn prim() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Prim)
    }

    pub fn lit() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Lit)
    }

    pub fn closure() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Closure)
    }

    pub fn error() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Error)
    }

    pub fn fn_sym() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Fn)
    }

    pub fn ampersand() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Ampersand)
    }

    pub fn apply() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Apply)
    }

    pub fn macro_sym() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Macro)
    }

    pub fn mac() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Mac)
    }

    pub fn quote() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Quote)
    }

    pub fn unquote() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Unquote)
    }

    pub fn unquote_splice() -> Gc<Maj> {
        sym_from_raw(MajRawSym::UnquoteSplice)
    }

    pub fn quasiquote() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Quasiquote)
    }

    pub fn do_sym() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Do)
    }

    pub fn vector_sym() -> Gc<Maj> {
        sym_from_raw(MajRawSym::Vector)
    }
}
#+end_src
