doc/html/04-02-tipos-de-dados-fundamentais.html

<div id="outline-container-org3b7986d" class="outline-2">
<h2 id="org3b7986d"><span class="section-number-2">16.</span> Construtores de símbolos constantes</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #4ec9b0;">MajRawSym</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::sym_from_raw;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">impl</span> <span style="color: #4ec9b0;">Maj</span> {
    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">prim</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Prim</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">lit</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Lit</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">closure</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Closure</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">error</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Error</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">fn_sym</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fn</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">ampersand</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Ampersand</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">apply</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Apply</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macro_sym</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Macro</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">mac</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Mac</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">quote</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Quote</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">unquote</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Unquote</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">unquote_splice</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">UnquoteSplice</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">quasiquote</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Quasiquote</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">do_sym</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Do</span>)
    }

    <span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">vector_sym</span>() -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
        sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Vector</span>)
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
